Напиши компонент формы авторизации в приложение, компонент на react, нужно вводить логин и пароль, также кнопка забыли пароль и кнопка сабмита, стили используй исходя из примеров в rag
Ошибка при обращении к модели: HTTP 401: {"status":401,"message":"Token has expired"}

Удали кнопку забыли пароль
Ошибка при обращении к модели: HTTP 401: {"status":401,"message":"Token has expired"}

Добавь кнопку авторизации через крипто-кошелек, также при клике на эту кнопку, нужно тригерить ивент по которым кошельки среагируют и попробуют подключиться к приложению
Ошибка при обращении к модели: HTTP 401: {"status":401,"message":"Token has expired"}

Измени кнопку подключения кошельков на конопку которая вызывает всплывающее окно со списком кошельков [metamask, rabby, keplr, phantom]
Ошибка при обращении к модели: HTTP 401: {"status":401,"message":"Token has expired"}

Для каждого кошелька из списка реализуй логику работы с кошельком по клику, а также подпись публичным ключем
Ошибка при обращении к модели: HTTP 401: {"status":401,"message":"Token has expired"}

Вывод и в верхнем правом углу кнопку disconnect, и адрес подключенного кошелька, после подключения нужно редиректить на главную страницу
Ошибка при обращении к модели: HTTP 401: {"status":401,"message":"Token has expired"}
